# Используем официальный базовый образ Python
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем только файлы зависимостей на первом этапе (для кэширования)
COPY requirements.txt .

# Устанавливаем зависимости без кеша, чтобы минимизировать размер образа
RUN python -m pip install uv
RUN uv pip install --system -r requirements.txt

# Копируем весь остальной проект
COPY . .

# Открываем порт, на котором будет работать Flask
EXPOSE 5000

# Запускаем приложение
CMD ["python3", "run.py"]